---
kind: method
id: M:Autodesk.Revit.DB.DimensionEqualityLabelFormatting.Dispose
source: html/0ed70c4f-cf51-ac89-1c73-f8ba7753eb82.htm
---
# Autodesk.Revit.DB.DimensionEqualityLabelFormatting.Dispose Method

Releases all resources used by the DimensionEqualityLabelFormatting

## Syntax (C#)
```csharp
public void Dispose()
```